Tekla.Structures.Dialog.UIControls.BindableRadioButton
The BindableRadioButton class represents a RadioButton control that can be bound to the dialog attributes file.
Use "Checked" as the BindPropertyName and "Integer" as the AttributeTypeName.

Tekla.Structures.Dialog.UIControls.BindableRadioButton.Checked
Gets or sets a value indicating whether the control is checked.

Tekla.Structures.Dialog.UIControls.BindableRadioButton.OnCreateControl
Overrides the standard OnCreateControl method in order to support the PropertyBinding.

Tekla.Structures.Dialog.UIControls.BindableRadioButton.OnCheckedChanged(System.EventArgs)
Overrides the standard OnCheckedChanged method in order to support the PropertyBinding.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.BindableRadioButton.OnClick(System.EventArgs)
Overrides the standard OnClick method in order to support the PropertyBinding.
EventArgs: The event arguments.